Tekla.Structures.Model.FacePerpendicularToIntersectionLineException
The FacePerpendicularToIntersectionLineException class represents an error when, face perpendicular to intersection line.

Tekla.Structures.Model.FacePerpendicularToIntersectionLineException.#ctor
Initializes a new instance of the FacePerpendicularToIntersectionLineException class with "face perpendicular to intersection line" error message.